--модуль з чистими функціями
module MathFunctions (
    square,
    absValue,
    maxOfTwo
) where

--функція square повертає квадрат числа
--вона є чистою, тому що:
--1) залежить лише від вхідного аргументу
--2) не має побічних ефектів (не читає і не змінює зовнішній стан)
square :: Int -> Int
square x = x * x

--функція absValue повертає модуль числа
--вона є чистою, тому що:
--1) для одного і того ж аргументу завжди повертає той самий результат
--2) не виконує введення/виведення
absValue :: Int -> Int
absValue x =
    if x < 0 then -x else x

--функція maxOfTwo повертає більше з двох чисел
--вона є чистою, тому що:
--1) результат залежить тільки від параметрів a і b
--2) не має побічних ефектів
maxOfTwo :: Int -> Int -> Int
maxOfTwo a b =
    if a > b then a else b
