--модуль з рекурсивними функціями
module RecursionFunctions (
    factorial,
    sumList
) where

--рекурсивна функція обчислення факторіалу числа n
--функція є чистою, оскільки:
--1) результат залежить тільки від аргументу n
--2) не має побічних ефектів
factorial :: Int -> Int
factorial 0 = 1
factorial n = n * factorial (n - 1)

--рекурсивна функція обчислення суми елементів списку
--функція є чистою, оскільки:
--1) працює тільки з вхідним списком
--2) не використовує змінні стану або введення/виведення
sumList :: [Int] -> Int
sumList [] = 0
sumList (x:xs) = x + sumList xs

