
%1.довжина списку: my_length(List, N)
%базовий випадок -довжина порожнього списку дорівнює 0
my_length([], 0).
%рекурсивний випадок: відкидую голову(_), рахую довжину хзвоста (tail), і додаю 1 до результату 
my_length([_|Tail], N) :- 
    my_length(Tail, N1), 
    N is N1 + 1.

%2.сума елементів списку: sum_list(List, Sum)
%базовий випадок: сума елементів порожнього списку - 0
sum_list([], 0).
%рекурсивний випадок: сума дорівнює голова + сума хвоста
sum_list([Head|Tail], Sum) :- 
    sum_list(Tail, TailSum), 
    Sum is Head + TailSum.

%3.максимальний елемент списку: max_list(List, Max)
%для непорожніх списків
%базовий випадок: якщо в списку лише один елемент, він і є максимальним
max_list([X], X).

%рекурсивний випадок 1: голова більша або дорівнює максимуму хвоста
max_list([Head|Tail], Max) :- 
    max_list(Tail, TailMax), 
    Head >= TailMax, 
    Max = Head.

%рекурсивний випадок 2: голова менша за максимум хвоста
max_list([Head|Tail], Max) :- 
    max_list(Tail, TailMax),
    Head < TailMax, 
    Max = TailMax.

%4.перетворення: map_square(Input, Result)
%базовий випадок: порожній список перетворюється на порожній список
map_square([], []).

%рекурсивний випадок: беру голову, далі підношу до квадрату (H2), і рекурсивно обробляю хвіст (T), формуючи новий хвіст(T2)
map_square([H|T], [H2|T2]) :- 
    H2 is H * H, 
    map_square(T, T2).